app/controllers/posts_controller.rb

SELECT * FROM `posts` ORDER BY created_at DESC LIMIT 0, 10
SELECT count(*) AS count_all FROM `posts`
---
  def index
#    @posts = Post.find(:all, :order => "created_at DESC")
#    @posts = Post.paginate_by_board_id @board.id, :page => params[:page], :order => 'updated_at DESC'
    @posts = Post.paginate :page => params[:page], :per_page => 10, :order => 'created_at DESC'

INSERT INTO `posts` (`updated_at`, `body`, `user_id`, `created_at`) VALUES('2009-02-01 16:15:03', 'hi!', 1, '2009-02-01 16:15:03')
---
  def create
    #TODO dar uma olhada nisso aqui depois
#    @post = @current_user.posts.build(params[:post])
    @post = Post.new(params[:post])
    @post.user_id = @current_user.id

    respond_to do |format|
      if @post.save