app/controllers/users_controller.rb

INSERT INTO `users` (`salt`, `updated_at`, `hashed_password`, `email`, `created_at`) VALUES('1IxD58ySLm', '2009-01-31 23:25:43', '4104076c3652013c10716160f2e539080a492b5a', 'hugo.barauna@gmail.com', '2009-01-31 23:25:43')
---
  def create
    @user = User.new(params[:user])

    if @user.save