app/controllers/user_sessions_controller.rb

  def create
    if @user = User.find_and_authenticate(params[:user])
      flash[:notice] = 'Login successfull'
      session[:user_id] = @user.id

      redirect_to(session[:return_to] || user_home_path)
    else
      @user = User.new(params[:user])

      if params[:user]
        if params[:user][:email].blank?
---
SELECT * FROM `users` WHERE (email = 'hugo.barauna@gmail.com') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`email` = 'hugo.barauna@gmail.com') LIMIT 1